{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "PaliGemmaForConditionalGeneration",
    "parent_library": "transformers.models.paligemma.modeling_paligemma"
  },
  "base_model_name_or_path": "google/paligemma-3b-mix-224",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "self_attn.q_proj",
    "self_attn.k_proj",
    "self_attn.v_proj",
    "self_attn.o_proj"
  ],
  "task_type": null,
  "use_dora": false,
  "use_rslora": false
}